app/Http/Controllers/AdminController.php

select
COUNT(*) as total,
SUM(CASE WHEN role = 'professor' THEN 1 ELSE 0 END) as professors,
SUM(CASE WHEN role = 'student' THEN 1 ELSE 0 END) as students
from "users" limit 1
select
COUNT(*) as total,
COUNT(CASE WHEN status = 'present' THEN 1 END) as present,
COUNT(CASE WHEN status = 'late' THEN 1 END) as late,
COUNT(CASE WHEN status = 'absent' THEN 1 END) as absent
from "attendance_records" limit 1
select count(*) as aggregate from "attendance_records" where "recorded_at"::date = '2026-05-26'
---
    public function dashboard(): View
    {
        // Cache totals for 10 minutes to save Supabase resources
        $stats = Cache::remember('admin_stats', 600, function () {
            // Combine all user counts into single query instead of 3 separate queries
            $userStats = User::selectRaw("
                COUNT(*) as total,
                SUM(CASE WHEN role = 'professor' THEN 1 ELSE 0 END) as professors,
                SUM(CASE WHEN role = 'student' THEN 1 ELSE 0 END) as students
            ")->first();

            $totalUsers = $userStats->total;
            $totalProfessors = $userStats->professors ?? 0;
            $totalStudents = $userStats->students ?? 0;
            $totalClasses = Classe::count();

            // Combine attendance counts into a single query
            $attendanceCounts = AttendanceRecord::selectRaw('
                COUNT(*) as total,
                COUNT(CASE WHEN status = \'present\' THEN 1 END) as present,
                COUNT(CASE WHEN status = \'late\' THEN 1 END) as late,
                COUNT(CASE WHEN status = \'absent\' THEN 1 END) as absent
            ')->first();

            $todayRecords = AttendanceRecord::whereDate('recorded_at', now())->count();

select * from "system_logs" order by "created_at" desc limit 10
select * from "users" where "users"."id" in (9, 16)
---

        // Cache recent logs for 1 minute
        $recentLogs = Cache::remember('admin_recent_logs', 60, function () {
            return SystemLog::with('user')->latest()->limit(10)->get();

select count(*) as aggregate from "users"
select count(*) as aggregate from "users" where "role" = 'admin'
select count(*) as aggregate from "users" where "role" = 'professor'
select count(*) as aggregate from "users" where "role" = 'student'
select count(*) as aggregate from "users" where "is_active" = 1
select count(*) as aggregate from "users" where "is_active" = 0
---
    private function getUserStats(): array
    {
        return Cache::remember('admin_user_stats', 300, function () {
            return [
                'total' => User::count(),
                'admins' => User::where('role', 'admin')->count(),
                'professors' => User::where('role', 'professor')->count(),
                'students' => User::where('role', 'student')->count(),
                'active' => User::where('is_active', true)->count(),
                'inactive' => User::where('is_active', false)->count(),
            ];
        });

select * from "users" limit 20 offset 0
select count(*) as aggregate from "users"
---
    public function users(): View
    {
        $role = request('role');
        $status = request('status');

        // Build query with filters
        $query = User::with('classes', 'attendanceRecords');

        if ($role && in_array($role, ['admin', 'professor', 'student'])) {
            $query->where('role', $role);
        }

        if ($status !== null && in_array($status, ['0', '1'])) {
            $query->where('is_active', (bool) $status);
        }

        // Cache with filter params
        $cacheKey = 'admin_users_' . md5($role . $status . request('page', 1));
        $users = Cache::remember($cacheKey, 60, function () use ($query) {
            return $query->paginate(20);

select "users".*, "class_professor"."class_id" as "pivot_class_id", "class_professor"."professor_id" as "pivot_professor_id", "class_professor"."created_at" as "pivot_created_at", "class_professor"."updated_at" as "pivot_updated_at" from "users" inner join "class_professor" on "users"."id" = "class_professor"."professor_id" where "class_professor"."class_id" in (1, 3, 4, 5, 6)
select count(*) as aggregate from "classes"
---
    public function professors(): View
    {
        // Cache professors for 1 minute
        $professors = Cache::remember('admin_professors_page_' . request('page', 1), 60, function () {
            return User::with('classes')->where('role', 'professor')->paginate(20);
        });

select "classes".*, "class_student"."student_id" as "pivot_student_id", "class_student"."class_id" as "pivot_class_id", "class_student"."created_at" as "pivot_created_at", "class_student"."updated_at" as "pivot_updated_at" from "classes" inner join "class_student" on "classes"."id" = "class_student"."class_id" where "class_student"."student_id" in (5, 7, 11, 12, 15)
select * from "qr_codes" where "qr_codes"."student_id" in (5, 7, 11, 12, 15)
select * from "users" where "role" = 'student' order by "name" asc limit 20 offset 0
select count(*) as aggregate from "users" where "role" = 'student'
---
    public function qrCodes(): View
    {
        $students = User::where('role', 'student')
              ->with(['enrolledClasses', 'studentQrCode'])
            ->orderBy('name')
            ->paginate(20, ['*'], 'students_page');

select * from "qr_codes" where "student_id" = 17 limit 1
---
    private function buildStudentQrSvg(User $student): string
    {
        $qrCode = QRCode::where('student_id', $student->id)->first();

select * from "attendance_records" limit 20 offset 0
select count(*) as aggregate from "attendance_records"
select COUNT(*) as total_records,
SUM(CASE WHEN status = 'present' THEN 1 ELSE 0 END) as present_count,
SUM(CASE WHEN status = 'late' THEN 1 ELSE 0 END) as late_count,
SUM(CASE WHEN status = 'absent' THEN 1 ELSE 0 END) as absent_count,
SUM(CASE WHEN status = 'excused' THEN 1 ELSE 0 END) as excused_count from "attendance_records" limit 1
---
    public function attendanceRecords(): View
    {
        $records = AttendanceRecord::with('student', 'classe')
            ->paginate(20);

        $attendanceStats = AttendanceRecord::selectRaw(
            'COUNT(*) as total_records,
             SUM(CASE WHEN status = \'present\' THEN 1 ELSE 0 END) as present_count,
             SUM(CASE WHEN status = \'late\' THEN 1 ELSE 0 END) as late_count,
             SUM(CASE WHEN status = \'absent\' THEN 1 ELSE 0 END) as absent_count,
             SUM(CASE WHEN status = \'excused\' THEN 1 ELSE 0 END) as excused_count'
        )->first();

        $totalRecords = (int) ($attendanceStats?->total_records ?? 0);
        $presentCount = (int) ($attendanceStats?->present_count ?? 0);
        $lateCount = (int) ($attendanceStats?->late_count ?? 0);
        $absentCount = (int) ($attendanceStats?->absent_count ?? 0);
        $excusedCount = (int) ($attendanceStats?->excused_count ?? 0);

        return view('admin.attendance-records-new', [
            'attendanceRecords' => $records,
            'totalRecords' => $totalRecords,
            'presentCount' => $presentCount,
            'lateCount' => $lateCount,
            'absentCount' => $absentCount,
            'excusedCount' => $excusedCount,
        ]);

select * from "system_logs" order by "created_at" desc limit 20 offset 0
select * from "users" where "users"."id" in (9, 16)
select count(*) as aggregate from "system_logs"
---
    public function logs(): View
    {
        // Cache logs for 1 minute
        $logs = Cache::remember('admin_logs_page_' . request('page', 1), 60, function () {
            return SystemLog::with('user')->latest()->paginate(20);