app/Http/Controllers/ProfessorController.php

select "users".*, "class_student"."class_id" as "pivot_class_id", "class_student"."student_id" as "pivot_student_id", "class_student"."created_at" as "pivot_created_at", "class_student"."updated_at" as "pivot_updated_at" from "users" inner join "class_student" on "users"."id" = "class_student"."student_id" where "class_student"."class_id" in (1, 5)
select * from "schedules" where "schedules"."class_id" in (1, 5)
select COUNT(*) as total_records, SUM(CASE WHEN status = 'present' THEN 1 ELSE 0 END) as present_count, SUM(CASE WHEN status = 'late' THEN 1 ELSE 0 END) as late_count, SUM(CASE WHEN status = 'absent' THEN 1 ELSE 0 END) as absent_count, SUM(CASE WHEN status = 'excused' THEN 1 ELSE 0 END) as excused_count from "attendance_records" where "class_id" in (1, 5) limit 1
---
    public function dashboard(): View
    {
        /** @var User $user */
        $user = Auth::user();
        // Use withCount() to get student counts in the initial query instead of calling count() in loop
        $classes = $user->assignedClasses()
            ->withCount(['students',
                'attendanceRecords as present_count' => function ($query) {
                    $query->where('status', 'present');
                },
                'attendanceRecords as late_count' => function ($query) {
                    $query->where('status', 'late');
                },
                'attendanceRecords as absent_count' => function ($query) {
                    $query->where('status', 'absent');
                },
                'attendanceRecords as excused_count' => function ($query) {
                    $query->where('status', 'excused');
                },
            ])
            ->with(['students', 'schedules'])
            ->get();

        $totalClasses = $classes->count();
        $totalStudents = $classes->sum('students_count');

        $attendanceSummary = AttendanceRecord::whereIn('class_id', $classes->pluck('id'))
            ->selectRaw("COUNT(*) as total_records, SUM(CASE WHEN status = 'present' THEN 1 ELSE 0 END) as present_count, SUM(CASE WHEN status = 'late' THEN 1 ELSE 0 END) as late_count, SUM(CASE WHEN status = 'absent' THEN 1 ELSE 0 END) as absent_count, SUM(CASE WHEN status = 'excused' THEN 1 ELSE 0 END) as excused_count")
            ->first();

select "classes".*, "class_professor"."professor_id" as "pivot_professor_id", "class_professor"."class_id" as "pivot_class_id", "class_professor"."created_at" as "pivot_created_at", "class_professor"."updated_at" as "pivot_updated_at" from "classes" inner join "class_professor" on "classes"."id" = "class_professor"."class_id" where "class_professor"."professor_id" = 2
select * from "schedules" where "schedules"."class_id" in (1, 5)
---
            ->limit(5)
            ->get();

        $todaySchedules = $user->assignedClasses()
            ->with('schedules')
            ->get()
            ->flatMap(fn($c) => $c->schedules)
            ->filter(fn($s) => str_contains($s->days, now()->format('l')));

select * from "schedules" where "schedules"."class_id" in (1, 5)
select "id", "name", "email" from "users" where "role" = 'student' order by "name" asc
---
    public function myClasses(): View
    {
        /** @var User $user */
        $user = Auth::user();
        $classes = $user->assignedClasses()
            ->withCount('students')
            ->with(['schedules', 'students:id'])
            ->get();

        $availableStudents = User::where('role', 'student')
            ->orderBy('name')
            ->get(['id', 'name', 'email']);

select * from "schedules" where "schedules"."class_id" in (3, 6)
---
    public function showClass(Classe $classe): View
    {
        $this->authorize('view', $classe);

        return view('professor.class-detail', [
            'classe' => $classe->load('students', 'schedules'),
        ]);

select "classes".*, "class_professor"."professor_id" as "pivot_professor_id", "class_professor"."class_id" as "pivot_class_id", "class_professor"."created_at" as "pivot_created_at", "class_professor"."updated_at" as "pivot_updated_at" from "classes" inner join "class_professor" on "classes"."id" = "class_professor"."class_id" where "class_professor"."professor_id" = 16
select "users".*, "class_student"."class_id" as "pivot_class_id", "class_student"."student_id" as "pivot_student_id", "class_student"."created_at" as "pivot_created_at", "class_student"."updated_at" as "pivot_updated_at" from "users" inner join "class_student" on "users"."id" = "class_student"."student_id" where "class_student"."class_id" in (3, 6)
---
    public function scanQR(): View
    {
        /** @var User $user */
        $user = Auth::user();
        $classes = $user->assignedClasses()->with('students')->get();

select "users".*, "class_student"."class_id" as "pivot_class_id", "class_student"."student_id" as "pivot_student_id", "class_student"."created_at" as "pivot_created_at", "class_student"."updated_at" as "pivot_updated_at" from "users" inner join "class_student" on "users"."id" = "class_student"."student_id" where "class_student"."class_id" in (5)
---
    public function schedules(): View
    {
        /** @var User $user */
        $user = Auth::user();
        $schedules = $user->assignedClasses()
            ->with('schedules')
            ->get()
            ->flatMap(fn($c) => $c->schedules);

select "classes".*, "class_professor"."professor_id" as "pivot_professor_id", "class_professor"."class_id" as "pivot_class_id", "class_professor"."created_at" as "pivot_created_at", "class_professor"."updated_at" as "pivot_updated_at" from "classes" inner join "class_professor" on "classes"."id" = "class_professor"."class_id" where "class_professor"."professor_id" = 16
select "users".*, "class_student"."class_id" as "pivot_class_id", "class_student"."student_id" as "pivot_student_id", "class_student"."created_at" as "pivot_created_at", "class_student"."updated_at" as "pivot_updated_at" from "users" inner join "class_student" on "users"."id" = "class_student"."student_id" where "class_student"."class_id" in (3, 6)
---
    public function students(): View
    {
        /** @var User $user */
        $user = Auth::user();
        $classes = $user->assignedClasses()
            ->with('students')
            ->get();

select "classes".*, "class_professor"."professor_id" as "pivot_professor_id", "class_professor"."class_id" as "pivot_class_id", "class_professor"."created_at" as "pivot_created_at", "class_professor"."updated_at" as "pivot_updated_at" from "classes" inner join "class_professor" on "classes"."id" = "class_professor"."class_id" where "class_professor"."professor_id" = 16
---
    public function editAttendanceRecord(AttendanceRecord $attendanceRecord): View
    {
        /** @var User $user */
        $user = Auth::user();
        abort_unless($user->assignedClasses()->whereKey($attendanceRecord->class_id)->exists(), 403);

        return view('professor.edit-attendance', [
            'record' => $attendanceRecord->load('student', 'classe'),
        ]);

insert into "system_logs" ("user_id", "action", "description", "ip_address", "user_agent") values (16, 'create_student', 'Professor created student account: Shawn Dy', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/148.0.0.0 Safari/537.36') returning "id"
---
    public function updateAttendanceRecord(Request $request, AttendanceRecord $attendanceRecord): RedirectResponse
    {
        /** @var User $user */
        $user = Auth::user();
        abort_unless($user->assignedClasses()->whereKey($attendanceRecord->class_id)->exists(), 403);

        $validated = $request->validate([
            'status' => 'required|in:present,late,absent,excused',
            'recorded_at' => 'required|date',
            'minutes_late' => 'nullable|integer|min:0',
        ]);

        $minutesLate = $validated['status'] === 'late'
            ? (int) ($validated['minutes_late'] ?? 0)
            : 0;

        $attendanceRecord->update([
            'status' => $validated['status'],
            'minutes_late' => $minutesLate,
            'recorded_at' => Carbon::parse($validated['recorded_at']),
        ]);

        SystemLog::create([
            'user_id' => Auth::id(),
            'action' => 'attendance_record',
            'description' => 'Updated attendance for ' . $attendanceRecord->student->name . ' in ' . $attendanceRecord->classe->name,
            'ip_address' => $request->ip(),
            'user_agent' => $request->userAgent(),
        ]);