app/Http/Controllers/ProfessorController.php

select student_id, COUNT(*) as total, SUM(CASE WHEN status = 'present' THEN 1 ELSE 0 END) as present, SUM(CASE WHEN status = 'late' THEN 1 ELSE 0 END) as late, SUM(CASE WHEN status = 'absent' THEN 1 ELSE 0 END) as absent from "attendance_records" where "class_id" in (6, 3) group by "student_id"
select COUNT(*) as total_records, SUM(CASE WHEN status = 'present' THEN 1 ELSE 0 END) as present_count, SUM(CASE WHEN status = 'late' THEN 1 ELSE 0 END) as late_count, SUM(CASE WHEN status = 'absent' THEN 1 ELSE 0 END) as absent_count from "attendance_records" where "class_id" in (6, 3) limit 1
---
    public function reports(Request $request): View
    {
        /** @var User $user */
        $user = Auth::user();
        $classes = $user->assignedClasses()->with('students')->get();
        $this->markMissingAttendanceAbsent($classes);
        $classId = $request->query('class_id');

        if ($classId) {
            $classe = $classes->find($classId);
            abort_unless($classe, 403);
            $students = $classe->students;
            $attendanceSource = AttendanceRecord::where('class_id', $classe->id);
        } else {
            $students = $classes->flatMap(fn ($classe) => $classe->students)->unique('id')->values();
            $attendanceSource = AttendanceRecord::whereIn('class_id', $classes->pluck('id'));

select * from "users" where "users"."id" in (9, 16)
---
    public function submitDropRequest(Request $request): RedirectResponse
    {
        /** @var User $user */
        $user = Auth::user();

        $validated = $request->validate([
            'class_id' => 'required|exists:classes,id',
            'student_id' => 'required|exists:users,id',
            'reason' => [
                'nullable',
                'string',
                'max:500',
                Rule::in([
                    'Schedule conflict',
                    'Transfer to another section',
                    'Medical reason',
                    'Academic performance',
                    'Personal reasons',
                ]),
            ],
        ]);

        $classe = Classe::findOrFail($validated['class_id']);
        $student = User::findOrFail($validated['student_id']);

        abort_unless($user->assignedClasses()->whereKey($classe->id)->exists(), 403);