app/Http/Controllers/StudentController.php

select "classes".*, "class_student"."student_id" as "pivot_student_id", "class_student"."class_id" as "pivot_class_id", "class_student"."created_at" as "pivot_created_at", "class_student"."updated_at" as "pivot_updated_at" from "classes" inner join "class_student" on "classes"."id" = "class_student"."class_id" where "class_student"."student_id" = 17
select * from "attendance_records" where "student_id" = 17 order by "recorded_at" desc limit 10
select
COUNT(*) as total,
SUM(CASE WHEN status = 'present' THEN 1 ELSE 0 END) as present,
SUM(CASE WHEN status = 'late' THEN 1 ELSE 0 END) as late,
SUM(CASE WHEN status = 'absent' THEN 1 ELSE 0 END) as absent,
SUM(CASE WHEN status = 'excused' THEN 1 ELSE 0 END) as excused
from "attendance_records" where "student_id" = 17 limit 1
---
    public function dashboard(): View
    {
        $user = Auth::user();
        $classes = $user->enrolledClasses()->with(['professors', 'schedules'])->get();

        // Get recent attendance records
        $recentAttendance = AttendanceRecord::where('student_id', $user->id)
            ->with(['classe'])
            ->orderBy('recorded_at', 'desc')
            ->limit(10)
            ->get();

        // Get all attendance statistics in a single query
        $stats = AttendanceRecord::where('student_id', $user->id)
            ->selectRaw("
                COUNT(*) as total,
                SUM(CASE WHEN status = 'present' THEN 1 ELSE 0 END) as present,
                SUM(CASE WHEN status = 'late' THEN 1 ELSE 0 END) as late,
                SUM(CASE WHEN status = 'absent' THEN 1 ELSE 0 END) as absent,
                SUM(CASE WHEN status = 'excused' THEN 1 ELSE 0 END) as excused
            ")
            ->first();